PX4/NuttX/arch/arm/src/stm32/hardware/stm32f427ax_rcc.h
/* Spread spectrum clock generation register */

#define RCC_SSCGR_MODPER_SHIFT      (0)       /* Bit 0-12: Modulation period */
#define RCC_SSCGR_MODPER_MASK       (0x1fff << RCC_SSCGR_MODPER_SHIFT)
#  define RCC_SSCGR_MODPER(n)       ((n) << RCC_SSCGR_MODPER_SHIFT)
#define RCC_SSCGR_INCSTEP_SHIFT     (13)      /* Bit 13-27: Incrementation step */
#define RCC_SSCGR_INCSTEP_MASK      (0x7fff << RCC_SSCGR_INCSTEP_SHIFT)
#  define RCC_SSCGR_INCSTEP(n)      ((n) << RCC_SSCGR_INCSTEP_SHIFT)
#define RCC_SSCGR_SPREADSEL         (1 << 30) /* Bit 30: Spread Select */
#define RCC_SSCGR_SSCGEN            (1 << 31) /* Bit 31: Spread spectrum modulation enable */

/* PLLI2S configuration register */

#define RCC_PLLI2SCFGR_PLLI2SN_SHIFT       (6)       /* Bits 6-14: PLLI2S N multiplication factor for VCO */
#define RCC_PLLI2SCFGR_PLLI2SN_MASK        (0x1ff << RCC_PLLI2SCFGR_PLLI2SN_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SN(n)        ((n) << RCC_PLLI2SCFGR_PLLI2SN_SHIFT)



#  define RCC_PLLI2SCFGR_PLLI2SQ_SHIFT     (24)      /* Bits 24-27: PLLI2S division factor for SAI1 clock */
#  define RCC_PLLI2SCFGR_PLLI2SQ_MASK      (0xf << RCC_PLLI2SCFGR_PLLI2SQ_SHIFT)
#    define RCC_PLLI2SCFGR_PLLI2SQ(n)      ((n) << RCC_PLLI2SCFGR_PLLI2SQ_SHIFT)

#define RCC_PLLI2SCFGR_PLLI2SR_SHIFT       (28)      /* Bits 28-30: PLLI2S division factor for I2S clocks */
#define RCC_PLLI2SCFGR_PLLI2SR_MASK        (7 << RCC_PLLI2SCFGR_PLLI2SR_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SR(n)        ((n) << RCC_PLLI2SCFGR_PLLI2SR_SHIFT)

/* PLLSAI configuration register */


#  define RCC_PLLSAICFGR_PLLSAIN_SHIFT     (6)       /* Bits 6-14: PLLSAI divider (N) for VCO */
#  define RCC_PLLSAICFGR_PLLSAIN_MASK      (0x1ff << RCC_PLLSAICFGR_PLLSAIN_SHIFT)
#  define RCC_PLLSAICFGR_PLLSAIN(n)        ((n) << RCC_PLLSAICFGR_PLLSAIN_SHIFT)

#  define RCC_PLLSAICFGR_PLLSAIQ_SHIFT     (24)      /* Bits 24-27: PLLSAI division factor for SAI clock */
#  define RCC_PLLSAICFGR_PLLSAIQ_MASK      (0x0F << RCC_PLLSAICFGR_PLLSAIQ_SHIFT)
#    define RCC_PLLSAICFGR_PLLSAIQ(n)      ((n) << RCC_PLLSAICFGR_PLLSAIQ_SHIFT)

#    define RCC_PLLSAICFGR_PLLSAIR_SHIFT   (28)      /* Bits 28-30: PLLSAI division factor for LCD clock */
#    define RCC_PLLSAICFGR_PLLSAIR_MASK    (7 << RCC_PLLSAICFGR_PLLSAIR_SHIFT)
#      define RCC_PLLSAICFGR_PLLSAIR(n)    ((n) << RCC_PLLSAICFGR_PLLSAIR_SHIFT)


/* Dedicated clocks configuration register */


#  define RCC_DCKCFGR_PLLI2SDIVQ_SHIFT     (0)       /* Bits 0-4: PLLI2S division 1..32 factor for I2S clock */
#  define RCC_DCKCFGR_PLLI2SDIVQ_MASK      (0x1f << RCC_DCKCFGR_PLLI2SDIVQ_SHIFT)
#    define RCC_DCKCFGR_PLLI2SDIVQ(n)      (((n)-1) << RCC_DCKCFGR_PLLI2SDIVQ_SHIFT)
#  define RCC_DCKCFGR_PLLSAIDIVQ_SHIFT     (8)       /* Bits 8-12: PLLSAI division 1..32 factor for SAI clock */
#  define RCC_DCKCFGR_PLLSAIDIVQ_MASK      (0x1f << RCC_DCKCFGR_PLLSAIDIVQ_SHIFT)
#    define RCC_DCKCFGR_PLLSAIDIVQ(n)      (((n)-1) << RCC_DCKCFGR_PLLSAIDIVQ_SHIFT)

#    define RCC_DCKCFGR_PLLSAIDIVR_SHIFT   (16)      /* Bits 16-17: PLLSAI division factor for LCD_CLK clock */
#    define RCC_DCKCFGR_PLLSAIDIVR_MASK    (0x3 << RCC_DCKCFGR_PLLSAIDIVR_SHIFT)
#      define RCC_DCKCFGR_PLLSAIDIVR_DIV2  (0 << RCC_DCKCFGR_PLLSAIDIVR_SHIFT)
#      define RCC_DCKCFGR_PLLSAIDIVR_DIV4  (1 << RCC_DCKCFGR_PLLSAIDIVR_SHIFT)
#      define RCC_DCKCFGR_PLLSAIDIVR_DIV8  (2 << RCC_DCKCFGR_PLLSAIDIVR_SHIFT)
#      define RCC_DCKCFGR_PLLSAIDIVR_DIV16 (3 << RCC_DCKCFGR_PLLSAIDIVR_SHIFT)
#    define RCC_DCKCFGR_SAI1ASRC_SHIFT     (20)      /* Bits 20-21: SAI1-A clock source selection */
#    define RCC_DCKCFGR_SAI1ASRC_MASK      (0x3 << RCC_DCKCFGR_SAI1ASRC_SHIFT)
#      define RCC_DCKCFGR_SAI1ASRC_PLLSAI  (0 << RCC_DCKCFGR_SAI1ASRC_SHIFT)
#      define RCC_DCKCFGR_SAI1ASRC_PLLI2S  (1 << RCC_DCKCFGR_SAI1ASRC_SHIFT)
#      define RCC_DCKCFGR_SAI1ASRC_ALTERNATE (2 << RCC_DCKCFGR_SAI1ASRC_SHIFT)
#    define RCC_DCKCFGR_SAI1BSRC_SHIFT     (22)      /* Bits 22-23: SAI1-B clock source selection */
#    define RCC_DCKCFGR_SAI1BSRC_MASK      (0x3 << RCC_DCKCFGR_SAI1BSRC_SHIFT)
#      define RCC_DCKCFGR_SAI1BSRC_PLLSAI  (0 << RCC_DCKCFGR_SAI1BSRC_SHIFT)
#      define RCC_DCKCFGR_SAI1BSuRC_PLLI2S  (1 << RCC_DCKCFGR_SAI1BSRC_SHIFT)
#      define RCC_DCKCFGR_SAI1BSRC_ALTERNATE (2 << RCC_DCKCFGR_SAI1BSRC_SHIFT)

#  define RCC_DCKCFGR_TIMPRE               (1 << 24) /* Bit 24: Timer clock prescaler selection */

#endif /* __ARCH_ARM_SRC_STM32_HARDWARE_STM32F427XX_RCC_H */
